#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{

	int		age, muge; //코드 스니펫 "int age, muge;" "age", "muge"의 두 가지 정수 변수를 선언하는 것으로 보입니다. 이러한 변수는 소수점이 없는 정수인 정수 값을 저장하기 위한 것일 수 있습니다

	printf("나이를 입력하세요/n");  //"printf" 함수를 사용하여 사용자에게 나이를 입력하라는 메시지를 표준 출력(일반적으로 콘솔 또는 터미널)에 표시하는 C 프로그래밍 언어 문입니다.
	scanf("%d", &age); // 20(Enter), 앰퍼샌드 "&" 기호는 "age" 변수의 메모리 주소를 "scanf" 함수에 전달하는 데 사용됩니다. 이것은 "scanf"가 변수 자체가 아니라 입력 값이 저장될 변수의 주소를 요구하기 때문에 필요합니다.

	printf("체중을 입력하세요/n"); //"printf" 함수를 사용하여 사용자에게 체중를 입력하라는 메시지를 표준 출력(일반적으로 콘솔 또는 터미널)에 표시하는 C 프로그래밍 언어 문입니다.
	scanf("%d", &muge); // 75(Enter), 앰퍼샌드 "&" 기호는 "muge" 변수의 메모리 주소를 "scanf" 함수에 전달하는 데 사용됩니다. 이것은 "scanf"가 변수 자체가 아니라 입력 값이 저장될 변수의 주소를 요구하기 때문에 필요합니다.

	printf("나이는 %d 체중은 %d 입니다/n", age, muge); // 나이는 20 체중은 75 입니다
}

