#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	float a = 3.14; //변수 "a"는 "float" 유형으로 선언되며, 이는 3.14, -1.23, 0.0 또는 123.456과 같은 부동 소수점 값을 저장할 수 있음을 의미합니다. 
	double b = 0.0002754; //변수 "b"는 "double" 유형으로 선언되며, 이는 0.0002754, -1.23, 0.0 또는 123.456과 같은 배정밀도 부동 소수점 값을 저장할 수 있음을 의미합니다.

	printf("a의 값은 소수연태로 %f 지수형태로 %f 지수 형태로 %e/n", a, a); // a의 값은 소수형태로 3.140000 지수 형태로 3.140000e+000
	printf("b 값은 소수연태로 %f 지수형태로 %f 지수 형태로 %e/n", b, b; // b 값은 소수형태로 0.000275 지수 형태로 2.754000e-004
}
