#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	char a, b, c; // "char"는 문자, 숫자 또는 기호와 같은 단일 문자를 나타내는 데이터 유형입니다. 이 경우 변수 "a", "b" 및 "c"는 각각 단일 문자 값을 저장할 수 있는 "char" 유형으로 선언됩니다.

	a = 'A'; // 선언을 기반으로 "a"는 문자 변수인 것으로 보입니다. 이 할당은 "a"의 값을 대문자 'A'에 대한 특정 ASCII 또는 유니코드 문자 표현인 문자 'A'로 설정합니다.
	b = 'a'; // "b"는 문자 변수인 것으로 보입니다. 이 할당은 "b"의 값을 소문자 'a'에 대한 특정 ASCII 또는 유니코드 문자 표현인 문자 'a'로 설정합니다.
	c = 'Z'; // 변수 "c"는 값 'Z'를 유지하며 애플리케이션의 특정 요구 사항에 따라 추가 작업 또는 표시 목적을 위해 코드에서 이 값을 사용할 수 있습니다.

	printf("문자형 변수에 저장된 값은 %c %c %c 입니다/n", a, b, c); // 문자형 변수에 저장된 값은 A a Z 입니다
}