#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	int a, b; //"int a, b;" "int" 유형의 "a" 및 "b"라는 이름의 두 변수를 선언합니다.
	char c; //"char"는 문자, 숫자 또는 특수 기호와 같은 단일 문자를 나타내는 데이터 유형입니다. 변수 "c"는 "char" 유형으로 선언합니다.
	a = 15; //변수 "a"는 값 15를 유지하며 응용 프로그램의 특정 요구 사항에 따라 추가 작업이나 계산을 위해 코드에서 이 값을 사용할 수 있습니다.
	b = 100; //선언 "int a, b;"에 따라 "b"는 정수 변수인 것으로 보입니다. 이 할당은 숫자 값 100을 나타내는 정수 리터럴인 "b" 값을 100으로 설정합니다.
	c = 'Z'; //변수 "c"는 값 'Z'를 유지하며 애플리케이션의 특정 요구 사항에 따라 추가 작업 또는 표시 목적을 위해 코드에서 이 값을 사용할 수 있습니다.

	printf("변수 a는 %d b는 %d c는 %c입니다/n", a, b, c);

	// 변수 a는 100 c는 Z입니다
}