#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	int age, height, muge; //코드 스니펫 "int age, height, muge;" "age", "height" 및 "muge"의 세 가지 정수 변수를 선언하는 것으로 보입니다. 이러한 변수는 소수점이 없는 정수인 정수 값을 저장하기 위한 것일 수 있습니다
	double j, k; //줄 이름이 "j" 및 "k"인 "double" 유형의 두 변수를 선언합니다.
	char p = 'A'; // "char"는 문자, 숫자 또는 기호와 같은 단일 문자를 나타내는 데이터 유형입니다. 이 경우 변수 "p"에는 문자 'A'를 나타내는 값 'A'가 할당됩니다.

	age = 20; //변수 "age"의 값을 20으로 설정하는 대입문이라는 점에 유의하는 것이 중요합니다. 변수 "age"는 이전에 적절한 데이터 유형으로 선언되고 초기화되어야 합니다
	height = 180; //변수 "height"의 값을 180으로 설정하는 대입문이라는 점에 유의해야 합니다. 변수 "height"는 이전에 적절한 데이터 유형으로 선언되고 초기화되어야 합니다
	muge = 70; // "muge"는 코드에서 이전에 선언된 변수 이름인 것으로 보입니다. 이 명령문은 "muge"의 값을 70으로 설정하며, 이는 코드의 특정 컨텍스트에서 "muge"와 연관된 값 또는 측정을 나타낼 수 있습니다.

	j = 3.5; // 변수 j에 3.5를 저장하고 출력해 보겠습니다.
	k = 0.72825; // 변수 k에 0.72825를 저장하고 출력해 보겠습니다.

	printf("나이는 %d 키는 %d 몸무게는 %d 입니다/n", age, height, muge); // 나이는 20 키 180 몸무게는 70 입니다
	printf("실수형 데이터 %f 와 %f 그리고 문자 %c/n", j, k, p); // 실수형 데이터 3.500000 와 0.728250 그리고 문자 A
}