#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	char	ch1 = 'A'; //변수 "ch1"에 문자 'A'를 할당합니다. 문자 'A'는 대문자 'A'를 나타내는 문자 리터럴입니다.
	char	ch2 = 'b'; //변수 "ch2"에 문자 'b'를 할당합니다. 문자 'b'는 소문자 'b'를 나타내는 문자 리터럴입니다.
	char	ch3 = 'c'; //변수 "ch3"에 문자 'c'를 할당합니다. 문자 'c'는 소문자 'c'를 나타내는 문자 리터럴입니다.

	printf("첫 번째 문자 = %c, %d/n", ch1, ch1); // 첫 번째 문자 = A, 65
	printf("두 번째 문자 = %c, %d/n", ch2, ch2); // 두 번째 문자 = B, 66
	printf("세 번째 문자 = %c, %d/n", ch3, ch3); // 세 번째 문자 = c, 67
}

