#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	char	name[20]; // 배열은 최대 19개의 문자와 문자열의 끝을 표시하기 위해 C에서 자동으로 추가하는 null 종결자 '\0' 문자를 저장할 수 있습니다.
	char	hob[50]; //"hob" 배열은 최대 49개의 문자와 문자열의 끝을 표시하기 위해 C에 의해 자동으로 추가되는 null 종결자 '\0' 문자를 저장할 수 있습니다.
	int			age; // 같은 대입문을 사용하여 "age"에 값을 할당하거나 "scanf"와 "%d"와 같은 입력 함수를 사용하여 사용자의 입력을 읽고 "age"에 저장할 수 있습니다.

	printf("이름을 입력하세요/n"); // 이름을 입력하세요
	scanf("%s", name); //문자열에서 필드 너비 지정자를 사용하여 이를 수행할 수 있습니다. 예를 들어 "name"이 20자 크기의 문자 배열로 선언된 경우 다음 구문을 사용할 수 있습니다.

	printf("나이를 입력하세요/n"); // 나이를 입력하세요
	scanf("%s", &age); // "%s"는 사용자 입력에서 문자열(문자 시퀀스)을 읽는 데 사용되며 인수로 문자 배열이 필요합니다. 그러나 귀하의 경우 "&age"를 사용하여 정수 변수 "age"를 읽으려고 하는데 이는 올바르지 않습니다.

	printf("취미를 입력하세요/n"); // 취미를 입력하세요
	scanf("%s", hob); // "scanf"를 사용하여 문자열을 읽을 때는 주의해야 합니다. 입력 문자열이 문자 배열의 크기보다 길면 잠재적으로 버퍼 오버플로가 발생할 수 있기 때문입니다. 이를 방지하기 위해 필드 너비 지정자와 함께 "%s" 형식 지정자를 사용하여 다음과 같이 읽는 문자 수를 제한할 수 있습니다.

	printf("%d 살의 %s님의 취미는 %s 입니다/n", age, name, hob); // 20 살의 채현석님의 취미는 음악감상 입니다.
}

