#include <stdio.h> // 우선 { } 의 역할은 중괄호 { } 안의 코드들을 묶어주는 역할을 한다.
void main() // void는 메모리를 차지하지 않기 때문에 void 타입의 변수는 성언이 불가, 중괄호 '{'로 시작하여 '}'로 끝난다.
{
	char	ch1, ch2, ch3; //C에서 "char" 데이터 유형은 문자, 숫자 및 기호와 같은 개별 문자를 나타내는 데 사용되며 1바이트의 메모리를 차지합니다. ASCII 값 또는 작은따옴표(' ')로 묶인 리터럴 문자로 문자를 저장할 수 있습니다.
	
	printf("세개의 글자를 입력하세요/n"); // 세개의 글자를 입력하세요
	scanf("%c%c%c", &ch1, &ch2, &ch3); // w(Enter),  변수 "ch1", "ch2" 및 "ch3"은 이러한 변수의 메모리 주소를 전달하는 데 사용되는 앰퍼샌드 "&" 기호와 함께 "scanf" 함수에 전달됩니다. 이것은 "scanf"가 변수 자체가 아니라 입력 값이 저장될 변수의 주소를 요구하기 때문에 필요합니다.

	printf("입력한 글자는 %c 와 %c 와 %c 입니다/n", ch1, ch2, ch3); // 입력한 문자는 w 와 x 와 y 입니다
}

